{
	"hackernewsArticles": [
		{
			"id": 1,
			"headline": "Ransomware attack locks down Souderton Area School District systems",
			"article": "No disruption is anticipated to the school calendar after the attack.The district's financial information is said to be secured since the financial systems are stored off-site.The attack story: Soon after the beginning of the new school year, a cyberattack hit the computers of Souderton Area School District. According to school district officials, the attack was due to a ransomware.Ransomware is a type of malware that typically locks down certain files on computers or servers and prohibits any access to those unless the victims make the ransom payment.How the district officials responded: The authority of Souderton Schools has confirmed and clarified the incident as a ransomware attack. In response to the attack, the district-wide computer network was shut and disabled, and the internet connection was brought down, the district officials affirmed.Adding to it, the officials said the incident may lead to some inconvenience as of now, but there is no threat to the safety of the data of students, staff, or the parents. They said that that the systems containing financial information are housed off-site and have not been affected. Every possible effort is being made to recover and restore the services.What next: The source of the attack stays unclear as of now. District officials are working in tandem with the FBI, the Department of Homeland Security, the Secret Service, and a cyber-security firm to address the situation.The school officials do not foresee any interruption to the school calendar. Meanwhile, students have been asked to shut off their school-issued devices and to return the devices to their school at the earliest."
		},
		{
			"id": 10,
			"headline": "New PsiXBot variant spotted with sextortion module and other updates",
			"article": "A new variant of the PsiXBot malware with a newly added sextortion module has been discovered by security researchers.This malware version tracked as 1.0.3, is spreading via the Spelevo exploit kit. It displays a new infrastructure that lets the bot change DNS entries to hide malicious activities.BackgroundThe first version of the PsiXBot malware was spotted in mid-2017, after which it has evolved significantly. This malware is notorious for logging keystrokes and harvesting browser credentials.Version 1.0.3, the latest known PsiXBot malware has been observed to host a sextortion module and a new fast-flux infrastructure. This version uses Google’s DNS over HTTPS (DoH) service to obtain IP addresses for the command and control domains.This malware is currently being dropped as a payload from the Spelevo exploit kit. It is also known to spread via phishing emails.How does it attack?The latest PsiXBot version has a module called ‘StartPorn’ that records material from infected devices.The recording is done when the infected machines browse websites that contain porn-related keywords.PsiXBot has a built-in dictionary of keywords. If any of these keywords are detected on the infected device, it begins recording audio and video.The recorded file is saved with ‘.avi’ extension and is sent to command and control domains.These videos and audios are said to be used for extortion purposes.The malware campaign has updated itself to send convincing emails with attachments from the infected host. These attachments contain malicious macros that retrieve the PsiXBot payload.What to expectThe StartPorn module seems incomplete and is expected to evolve with time. Proofpoint published a detailed analysis of this malware.This malware is continuously updating module features and overall capability.It is speculated that the threat actors behind PsiXBot are aiming to be on par with other similar malware."
		},
		{
			"id": 13,
			"headline": "Chinese cyber-espionage group Thrip targets organizations in South East Asia",
			"article": "In recent attacks, the APT group was spotted using a previously unseen backdoor dubbed ‘Hannotog’ and another backdoor dubbed ‘Sagerunex’.Researchers noted that the Sagerunex backdoor is an evolution of an older tool dubbed ‘Evora’, which has been used by the Billbug group.The Chinese cyber-espionage group dubbed ‘Thrip’ targets entities in Southeast Asia, including military, defense, telecom companies, satellite communications, media, and educational organizations.About the groupThrip threat actor group has been active since 2013 targeting organizations in Southeast Asia, Hong Kong, Macau, Indonesia, the Philippines, Malaysia, and Vietnam.Researchers at Symantec first published details about Thrip in 2018 and has now confirmed that the group continues to target Southeast Asia.Malware used by ThripIn recent attacks, the group was spotted using a previously unseen backdoor dubbed ‘Hannotog’ and another backdoor dubbed ‘Sagerunex’. Thrip was also spotted using an info-stealer dubbed ‘Catchamas’.Hannotog is a custom malware that has been used by Thrip since at least January 2017. This backdoor enables the attackers to gain persistence on the victim’s network.Apart from malware, Thrip also utilizes dual-use tools and living-off-the-land tactics such as credential dumping, archiving tools, powerShell, and proxy tools.Connections with Billbug groupResearchers noted that the Sagerunex backdoor is an evolution of an older tool dubbed ‘Evora’, which has been used by the Billbug group. After analyzing the strings and code flow between the two malware, researchers determined that,The code for logging is the same for both Sagerunex and EvoraThe logging string format is similar in both malwareThe log name for both the malware starts with “\\00EV”Similarly, C&C communication code flows are also the same for both.“Its link to the Billbug group puts its activities into context and proves its attacks are part of a broader range of espionage activity heavily focused on (but not limited to) governments, armed forces, and communications providers,” researchers concluded."
		},
		{
			"id": 8,
			"headline": "Vulnerable Verizon Wireless Systems Exposes 2 Million Customer Contracts",
			"article": "The exposed contracts contained information such as full name, address, mobile number, and signature of customers.It also included the model and the serial number of the device brought by customers.A series of vulnerabilities discovered in Verizon Wireless systems could have been exploited by hackers to gain access to 2 million customer contracts.What’s the matter?The issue came to the light while UK-based researcher Daley Bee was analyzing a subdomain of Verizon Wireless systems.The subdomain ‘telestore.verizonwireless.com’ is used for employees to access internal Point of Sales tools and view customer information.Using Google dorks, Bee was able to find some valid paths of Verizon Employee tools and began to ‘dirsearch’ them for more directories and files.“From the Google Dorking, I also learnt the path used to view Verizon Wireless Pay Monthly customers contracts in PDF format - although we had to be authenticated for this - that always leading to a 404. I bruteforced GET parameters to find the a parameter and the m parameter,” added the researcher.What data was exposed?The exposed contracts contained information such as full name, address, mobile number, and signature of customers. It also included the model and the serial number of the device brought by customers.Bee determined that there were a total of roughly 2 million valid combination parameters affected by the IDOR flaw.“After a quick check, I learnt that 1310000000 was the lowest contract number that could be viewed and 1311999999 was the highest. That means that there was information of around 2 million Verizon Pay Monthly customers exposed,” Bee explained in a blog post."
		},
		{
			"id": 3,
			"headline": "Intel server-grade CPUs plagued by new NetCAT vulnerability",
			"article": "Security researchers have reported a new vulnerability in Intel chips that abuses the Data-Direct I/O (DDIO) feature.Named NetCAT, this vulnerability allows attackers to observe keystrokes in SSH sessions in the compromised machines.OverviewVrije University has published details of the NetCAT vulnerability in the Intel server-grade CPUs. It allows the abuse of Intel DDIO to infiltrate into machines and networks.DDIO was introduced to make Intel CPUs more efficient in terms of speed. It allows peripherals to access the CPU’s cache to read and write data.NetCAT can compromise an SSH session by just sending network packets to the server. It does not require any malicious code to launch the attack.This vulnerability, tracked as CVE-2019-11184 by Intel, is a side-channel leak that requires direct access to the vulnerable system.How can the vulnerability be exploited?Attackers can observe what is processed in a DDIO-enabled CPU by sending a crafted network packet. However, this requires direct access to the system from the attacker’s network.The research outlines a technique called prime+probe. Using this technique, attackers can look for variations in the latency of the connection. Depending on the variation, they can detect what data was processed.An interactive SSH session sends network packets every time a key is pressed. Based on the arrival of the packet, NetCAT can leak the timing of the keystroke.Analyzing human typing patterns, this vulnerability exposes what users type in their private SSH sessions.If Remote Direct Memory Access (RDMA) is also enabled, the remote server’s memory can be accessed to control the location of network packets.What did the Intel team do?Intel was notified of the vulnerability in June, but no security patch is available yet as it is classified as a low severity vulnerability.An Intel spokesperson told ZDNet, “Intel received notice of this research and determined it to be low severity (CVSS score of 2.6) primarily due to complexity, user interaction, and the uncommon level of access that would be required in scenarios where DDIO and RDMA are typically used.”Mitigation advice was released by Intel that includes limiting direct access from untrusted networks when DDIO and RDMA are enabled."
		},
		{
			"id": 7,
			"headline": "LokiBot makes comeback in malspam campaign targeting US manufacturing company",
			"article": "The email appeared to come from a potentially compromised ‘trusted’ sender - originating from the IP address 23.83.133.8 - and requested a quotation.The attachment came in the form of the #RFQE67Y54.7z file and actually included the LokiBot.\nA new malspam campaign targeting a large U.S. manufacturing company has been observed lately. The campaign was used to distribute the infamous LokiBot trojan that is capable of stealing sensitive information.\nHow did the attack occur?Discovered by researchers from Fortinet, the campaign involved attackers sending a spam email to the sales department of the organization.\nThe email appeared to come from a potentially compromised ‘trusted’ sender - originating from the IP address 23.83.133.8 - and requested a quotation.The email has been written in a simple language by a non-native English speaker. In order to create a sense of urgency, it asked the recipient to open the attachment as the sender’s colleague is currently out of the office and to provide further clarification about the matter.The attachment came in the form of #RFQE67Y54.7z file which actually contained the LokiBot.\nWhat are the capabilities?Once the target unzipped the attached archive, the system got infected with LokiBot trojan. When it successfully compromised its victims’ computers, LokiBot harvested a variety of sensitive information and sent it to its operator’s C2 server as part of an HTTP POST request.\n\"LokiBot steals a variety of credentials – primarily FTP credentials, stored email passwords, passwords stored in the browser, as well as a whole host of other credentials,\" added the researchers.\nBottom lineUpon a closer look, researchers uncovered that a particular IP address appears to have been used twice prior to this malspam campaign. It is linked to the attacks that occurred in June. The attack had affected the customers of a large German Bakery."
		},
		{
			"id": 5,
			"headline": "Operation reWired: 281 suspects arrested in Business Email Compromise crackdown",
			"article": "Operation reWired, a massive effort targeted at Business Email Compromise (BEC) schemes, has resulted in the arrest of 281 suspects.The arrests were made in multiple countries including Nigeria, United States, Turkey, and Ghana. Nearly $3.7 million was seized and around $118 million was recovered in fraudulent wire transfers.What is BEC?Business Email Compromise is an online scam in which an attacker disguised as a corporate executive, convinces the employees of the organization, clients, or partners to transfer funds.BEC scams may also target personally identifiable information (PII) or employee tax records in addition to money.The big pictureFBI announced the arrest of 281 alleged email scammers as a result of Operation reWired.Out of the 281 arrests, 167 were made in Nigeria, 74 in the United States, 18 in Turkey, and 15 in Ghana. Other arrests were also made in Kenya, Japan, France, Italy, Malaysia, and the United Kingdom.Officials seized $3.7 million in cash and recovered $118 million in fraudulent wire transfers.The operation, that spanned over a period of four months, was a coordinated effort by FBI officers, local task force officers, U.S. Department of Homeland Security, U.S. Department of Justice, U.S. Department of State, U.S. Postal Inspection Service, and U.S. Department of the Treasury.Operation reWired follows last year’s Operation WireWire, which was a similar effort that resulted in 74 arrests.What should you do?If you have reasons to believe that you are a victim of a BEC scheme, contact law enforcement officers immediately. As preventive measures, the Internet Crime Complaint Center recommends:Use two-factor authentication to verify account-related changes.Ensure that hyperlinks are not misspelled names of legitimate domains.Make sure emails that request fund transfers are authentic before performing any financial transactions.Avoid providing personal information in email responses.Educate employees about online scams, and equip them with preventive and mitigative strategies."
		},
		{
			"id": 2,
			"headline": "Adobe’s Patch Tuesday Fixes Code Execution Bugs and DLL Flaw in Flash Player",
			"article": "Adobe’s Flash Player was found containing critical vulnerabilities that could lead to Arbitrary Code Execution.Two bugs were addressed in the Flash Player 32.0.0.255 release with a priority level 2, while the DLL hijacking bug was assigned a priority level 3 (for Windows OS).Adobe, on Tuesday, released multiple security updates in the form of patches for Flash Player on Windows, macOS, Linux, and Chrome OS. The update was in reference to the execution vulnerabilities discovered in Adobe Flash Player 32.0.0.255 and DLL files (of Application Manager).Why it matters: The two flaws, identified as CVE-2019-8070 and CVE-2019-8069, are a use-after-free issue which could have prompted attackers to execute arbitrary code in the context of the targeted user.Both issues were rated as “critical”. However, Adobe researchers think claim that exploiting these vulnerabilities would prove to be difficult. Hence, a priority rating of 2 (and 3 on Linux systems) was assigned to these vulnerabilities.Further, Adobe also fixed a DLL hijacking flaw, tracked as CVE-2019-8076, in the installer of the Application Manager. By exploiting this flaw, attackers could gain access to the user system by executing arbitrary code. The vulnerability was classified as “important” and received a priority rating of 3.“This vulnerability exclusively impacts the installer used with the Adobe Application Manager. CVE-2019-8076 does not impact the existing Application Manager, and there is no action for a customer running earlier versions,” continues the security advisory.What did Adobe do: For Flash Player 32.0.0.255 release, Adobe released security updates for Adobe Flash Player for Windows, macOS, Linux, and Chrome OS. These updates address critical vulnerabilities in the software.For the DLL vulnerability, Adobe released a security update for the Adobe Application Manager installer for Windows. This update resolves the insecure library loading issue in the installer."
		},
		{
			"id": 12,
			"headline": "Get app exposes personal information of nearly 50,000 university students",
			"article": "The personal details of roughly 50,000 students involved in university societies and clubs around Australia have been exposed online due to a vulnerability in Get app.Upon learning the incident, Get’s engineering team took immediate steps to address the potential vulnerability by reviewing and tokenizing all API calls.What is the issue?The personal details of roughly 50,000 students involved in university societies and clubs around Australia have been exposed online due to a vulnerability in Get app.Get, previously known as Qnect, is an online ticketing service used by university societies and clubs to facilitate payments for events and merchandise. According to its website, Get has more than 159,000 students from 453 university societies and clubs in its community.What happened?On September 7, 2019, Get app learned about a potential vulnerability in its systems that could expose the personal information of students. Upon which, the online ticketing service immediately launched an investigation on the incident. What was exposed?Get app users claimed that they were able to access users’ data including names, dates of birth, email addresses, Facebook IDs, and phone numbers, through the company’s search function API.Meanwhile, an engineering student from the University of Canberra told ABC that he found the personal data of about 200,000 users dating back more than a year. The student added that he found searches that led him to believe hackers had tried to access the information, including SQL injection attempts.He also found queries for the last four digits of a credit card and names on hashed passwords.However, Get confirmed that no personal payment information is stored in its databases and all payments are processed by a secure third-party payment processor.What actions have been taken?Upon learning about the incident, Get’s engineering team took immediate steps to address the potential vulnerability by reviewing and tokenizing all API calls.The online ticketing app promptly reviewed all API calls to determine what data had been accessed. It has also notified the organizations who use its platform about the incident and the actions taken in response.“We appreciate the patience of our partner clubs, many of whom we have been in open and honest communication with over the previous days. Should we discover that any data was obtained from our database we will contact affected individuals. In the meantime, users of our platform should, as always, remain wary of any unusual phone calls, text messages or emails,” Get said in the latest update."
		},
		{
			"id": 6,
			"headline": "Microsoft’s September 2019 Patch Tuesday fixes 79 vulnerabilities",
			"article": "Microsoft has rolled out fixes for 79 vulnerabilities as a part of its September 2019 Patch Tuesday.This includes fixes for two zero-day exploits and 17 critical vulnerabilities.The September 2019 Patch Tuesday brings security patches from Microsoft for 79 vulnerabilities that span across 15 products.Security patches available for two zero-day exploitsTwo zero-day exploits, CVE-2019-1214 and CVE-2019-1215, were patched this month. Both of them are Elevation of Privilege (EoP) vulnerabilities.An EoP vulnerability can be exploited to execute malicious code on an infected system by gaining administrator access.CVE-2019-1214 is the Windows Common Log File System Driver Elevation of Privilege Vulnerability and CVE-2019-1215 is the Windows Elevation of Privilege Vulnerability.Microsoft has not disclosed any details about how these zero-days were exploited.“Both flaws exist due to improper handling of objects in memory by the respective drivers. Elevation-of-privilege vulnerabilities are utilized by attackers post-compromise, once they’ve managed to gain access to a system in order to execute code on their target systems with elevated privileges,” said Satnam Narang, a senior research engineer at Tenable.Critical bugs in RDP fixedFour critical flaws —CVE-2019-1291, CVE-2019-1290, CVE-2019-0788, CVE-2019-0787—in Microsoft’s Remote Desktop Protocol (RDP) feature have been fixed. These vulnerabilities, when exploited, allow remote code execution by malicious servers.Advisories releasedMicrosoft has released two advisories in September’s Patch Tuesday.ADV190022 - September 2019 Flash Security Updated. This provides security updates for vulnerabilities defined in Adobe Security Bulletin APSB19-46: CVE-2019-8069 and CVE-2019-8070ADV990001 - Latest Servicing Stack UpdatesWhat to look out forOther organizations such as Adobe and SAP also publish security updates on the day of Microsoft’s Patch Tuesday."
		},
		{
			"id": 16,
			"headline": "Phishers leverage Captcha code to bypass email security gateway",
			"article": "The captcha technique is used to prove human presence while preventing any red flags from the email security gateway.The attack is initiated by sending a phishing email from a compromised account ‘@avis.ne.jp’.Phishing threat actors have now found a new technique to bypass the secure email gateway(SEG). This time, they are using the Captcha to prove human presence, while preventing any red flags from the email security gateway.How does it work?Discovered by researchers from Cofense, the attack is initiated by sending a phishing email from a compromised account ‘@avis.ne.jp’. The email pretends is disguised as a notification for a voicemail message.The victim is asked to preview the alleged communication by clicking on a button included in the email. This button, when clicked, takes the victim to the page with the Captcha code.“This button is in fact an embedded hyperlink that will redirect the recipient to a page that contains a Captcha code to prove the victim is a human and not an automated analysis tool or, as Google puts it, “a robot.” It’s at this point that the SEG validation would fail,” researchers added.Worth notingThe researchers note that both the captcha and phishing pages are hosted on the Microsoft infrastructure. As a result, they have legitimate top-level domains, ensuring no detection by SEGs during their URL analysis process.“The SEG cannot proceed to and scan the malicious page, only the Captcha code site. This webpage doesn’t contain any malicious items, thus leading the SEG to mark it as safe and allow the user through,” explained the researchers.What next?Once the human verification is complete, the recipient is redirected to an actual phishing page. In this case, the phishing page imitates the Microsoft account selector and login page. The phishing page is meant to capture login credentials entered by victims.Other creative campaignsThis is not the first time that the cybercriminals have come up with an innovative way to bypass security controls. In past campaigns, fraudsters have used QR codes, fake 2FA code and Google Docs to redirect victims to phishing pages."
		},
		{
			"id": 15,
			"headline": "Trail’s End exposes personal information of Boy Scouts",
			"article": "A web developer and a Scout parent noticed that the personal information of Boy Scouts was visible through a simple search.The exposed information includes children’s full names, dates of birth, email addresses, phone numbers, parent names, favorite products, and affiliation.What is the problem?Trail’s End suffered a data breach compromising the personal information of children and parents associated with the Boy Scouts of America.Trail’s End is a fundraising organization that partners with the Boy Scouts of America to help them raise money for programs and activities.What information was compromised?The exposed information includes children’s full names, dates of birth, email addresses, phone numbers, parent names, favorite products, and affiliation.The big pictureA web developer and a Scout parent noticed that the personal information of Boy Scouts was visible through a simple search. Upon which, the web developer notified Trail’s End about the data exposure.Upon becoming aware of the incident, Trail’s End promptly fixed the vulnerability that allowed unauthorized users to view the data.The fundraising organization then notified the Boy Scouts of America and other local councils about the data exposure.“We apologize for this incident. We are taking steps to increase the security and monitoring of our systems and will continue to put our users first,” Trail’s End said, Charlotte Agenda reported.What is the impact?Exactly how many users’ information was exposed during the incident and how long the information was exposed still remains unclear. However, Boy Scouts of America has over 2.3 million youth members and nearly 1 million adult volunteers.What they’re saying?Trail’s End denied the characterization of the issue as a “data leak”, stating that the data incident was noticed by a web developer who knew how to find information, unlike other users.“The person who accessed the data is a Scout parent who is a web developer and knew how to find information that most users do not,” Chris Naviaux, Chief Information Officer at Trail’s End said."
		},
		{
			"id": 9,
			"headline": "Over 1 Million Im​perial Dabman Internet Radios Likely Under Hijack Threat",
			"article": "Vulnerability-Lab researchers found two vulnerabilities - Undocumented Telnet Service (telnetd) and AirMusic Unauthenticated Command Execution (httpd) - affecting the internet radio devices.The first vulnerability found in internet radio devices permits attackers to remotely hijack systems.The second vulnerability was found in the AirMusic client of the internet radio device. In this, attackers could transmit and receive commands without client authentication.What happened?A few weeks ago, researchers from Vulnerability-Lab came across an anomaly on a private broadcast of internet radio. Further investigation into the matter led them to an undocumented telnetd server on the standard port 23 of the internet radio during a port scan. It was found that the network had enabled port forwarding for all ports, allowing adversaries to gain unauthorized access to the radio and to the OS subsequently.\nThe issue (CVE-2019-13473) was found in the internet radios of Imperial Dabman which are distributed in Germany by Telestar Digital GmbH. The products are sold across Europe via eBay, Amazon resellers. The devices utilize Bluetooth and Internet connectivity, and are based on BusyBox Debian Linux.\nThe second vulnerability (CVE-2019-13474) detected in the AirMusic client onboard the device permitting unauthenticated command-execution. “Using the mobile application on Apple iOS in combination with the port scan result shows us by intuition that the AirMusic client may be connecting on port 80 through 8080 httpd to send and receive commands,” said the researchers.The researchers also released a proof-of-concept video showing how the devices could be exploited.What is the scope of the attack?It is estimated that over 1 million models of the Imperial Dabman internet radio series could be vulnerable. By exploiting this vulnerability, attackers can perform malicious activities such as:Blackmailing, shocking and simple web-server defacements;Changing the device name, altering the radio stream, or deliver their live message or transmit audio files as commands;Modifying the system to spread ransomware or other malformed malicious viruses/rootkits/destructive scripts;Converting the web server into an IoT botnet and more.How was it resolved?Addressing the concern, Telstar said that it will not be using Telnet going forward. For existing deployments, it released manual binary patches that can be downloaded from the Telestar Digital Gmbh website. Also, an automated over-the-air update will be made available via the webradio firmware update function in the local settings menu. The process for installing the update is as follows:\nSet the device to the factory settingSelect languageSwitch off the deviceSwitch on the deviceNetwork setupWait for the \"New Software\" messagePress OK to start the updateUpdated Version: TN81HH96-g102h-g103**a*-fb21a-3624"
		},
		{
			"id": 11,
			"headline": "New instance of Chrome patch gapping reported",
			"article": "A new instance of patch gapping in Google Chrome has been reported by an Exodus Intelligence researcher, István Kurucsai.A recent patch for Chrome’s V8 JavaScript engine bug was developed in August but will reach users only on September 10.What is patch gapping?Patch gap describes the time window between the fix of a security bug and its availability to the users. This time window can be leveraged by hackers who closely follow security patches and attack systems before the patch is made public.The time period between the fix and release of the fix may even extend to months, and this is causing increased concern in the security world.Details about Chrome’s patch gapAlthough patch gaps occur frequently, ones that can actually be misused by attackers aren’t many. However, the latest instance of the patch gap by Chrome opens up opportunities for hackers to develop an exploit and execute malicious code on users’ browsers.The V8 bug, whose fix caused a patch gap we’re discussing, is said to be critical.Tracked as #992914, the patch for this bug was made in August but scheduled to go live along with the release of Chrome 77 on September 10.Cyber attackers had sufficient time to analyze Chrome fixes, and develop an exploit to make use of the patch gap.This patch gap was exposed by István Kurucsai, a security researcher at Exodus Intelligence.Exploiting this patch gapAlthough developing exploits for Chrome is not easy, an attacker with a strong background in JavaScript could do it.To emphasize the possibility of the exploit, Kurucsai released proof of concept code on GitHubThis exhibits how attackers can make use of the V8 bug to run malicious code in Google Chrome.This code isn’t fully effective as attackers need to exploit another vulnerability to escape the Chrome sandbox. However, hackers could still target older versions of Chrome where both the bugs aren’t fixed.What can you do?The exploit does not exhibit any unusual behavior and so detecting malicious code is quite difficult. It is recommended to disable JavaScript execution in Chrome settings as a temporary mitigation measure until the vulnerability is completely patched by Google."
		},
		{
			"id": 14,
			"headline": "Data of Over 4 Million Israeli Citizens Impacted Due to Security Lapse on Likud Party’s Campaign Website",
			"article": "The database belonging to the party was left open to the public for almost five days before it was secured.For each and every person in the registry, the Likud database included the associated full name, address, mobile phone number, and ID number.An unprotected database belonging to the Likud party had exposed the personal data of over 4 million Israeli citizens. The database was left open to the public for almost five days before it was secured.What data was involved?According to a report from Haaretz, the database contained the details of those who supported the party. For each and every person in the registry, the Likud database included the associated full name, address, mobile phone number, and ID number. The database also contained voting preferences of individuals in relation to the Likud party.For some citizens, social security numbers were also exposed due to the leaky database.While about half a million Israelis were classified not supporting the party, about 600,000 were deemed supporters and 80,000 were undecided. An additional 1.9 million people were listed as ‘undefined’.What was the impact?The leaked information was partially accessible via a website provided by a Likud app. It was found that anybody accessing the site’s ‘subdomain’ would give them full access to the list.What action has been taken?The Likud party had immediately blocked access to the site as soon as it became aware. The report states that the database also contained the personal information of the Israeli Prime Minister and his family members. This included their social security numbers and addresses."
		},
		{
			"id": 4,
			"headline": "Hackers Infiltrate Wakulla County School District computers",
			"article": "Wakulla County Schools has become the latest government entity to be targeted by hackers or cybercriminals. No ransom has been demanded yet, but the experts suggest it is a ransomware attack.The incident storyOn Tuesday morning, the district experienced a disruption in its information systems and found trouble in communicating via email.The incident has reportedly led to the outage of the email communication of Wakulla Schools.According to school officials, the disruption in the services has been occurring for over a week.Ransomware attackers typically hack into a system and lock it down threatening to destroy the stored data or leak confidential information into the public. The access to systems is denied until a ransom is transferred to the account of the attackers.Post-attack effortsThe officials of state and federal law enforcement were notified immediately after the attack.A forensic firm was contacted to look into the matter and restore the system safelyIn the official statement:The Superintendent Robert Pearce stated, “as we work to complete the investigation, we will look for opportunities to further enhance our existing security measures.”The district claimed (in a Facebook post) that its working diligently with a leading forensic firm and law enforcement to secure systems and bring them back online."
		}
	]
}